#### SORTING

In [1]:
import pandas as pd

In [4]:
data = {
    "Name" : ["Ram","Shyam","Ghanshyam","Chirag","Mohan"],
    "Age" : [25,26,25,28,35],
    "Salary" : [20000,30000,35000,40000,10000],
    "City" : ["Delhi","Meerut","Pune","Noida","Meerut"]
}
df = pd.DataFrame(data)
df

        Name  Age  Salary    City
0        Ram   25   20000   Delhi
1      Shyam   26   30000  Meerut
2  Ghanshyam   25   35000    Pune
3     Chirag   28   40000   Noida
4      Mohan   35   10000  Meerut

In [7]:
#sorting based on one column

new1 = df.sort_values(by = "Name",ascending = True,inplace = False)
print(new1)

        Name  Age  Salary    City
3     Chirag   28   40000   Noida
2  Ghanshyam   25   35000    Pune
4      Mohan   35   10000  Meerut
0        Ram   25   20000   Delhi
1      Shyam   26   30000  Meerut

In [ ]:
#sorting based on multiple columns
#first sort by primary columns and then for same row values in primary column, sort by second column

data = {
    "Name" : ["Ram","Shyam","Ghanshyam","Chirag","Mohan"],
    "Age" : [25,26,25,28,35],
    "Department" : ["HR","IT","HR","IT","Technical"],
    "Salary" : [20000,30000,35000,40000,10000],
    "City" : ["Delhi","Meerut","Pune","Noida","Meerut"]
}
df = pd.DataFrame(data)

df.sort_values(by = ["Department","Salary"], ascending = [True,True], inplace = True)
df

        Name  Age Department  Salary    City
0        Ram   25         HR   20000   Delhi
2  Ghanshyam   25         HR   35000    Pune
1      Shyam   26         IT   30000  Meerut
3     Chirag   28         IT   40000   Noida
4      Mohan   35  Technical   10000  Meerut

#### AGGREGATION
to summarise the data

In [24]:
data = {
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 
                 'Frank', 'Grace', 'Hannah', 'Ian', 'Jack'],
    'Department': ['HR', 'IT', 'IT', 'HR', 'Finance',
                   'Finance', 'IT', 'HR', 'Finance', 'IT'],
    'Salary': [40000, 50000, 45000, 60000, 55000,
               48000, 52000, 42000, 47000, 51000],
    'Experience': [2, 5, 3, 7, 10,
                   4, 6, 2, 8, 5],
    'Gender': ['F', 'M', 'M', 'M', 'F',
               'M', 'F', 'F', 'M', 'M']
}

df = pd.DataFrame(data)

print(df['Salary'].mean())      #to write the average salary(single column)

print("Summarise based on grouping values in a column")
print(df.groupby("Department")['Salary'].mean())      #to write the average salary of each department

print("Summarizing based on grouping multiple columns")
print(df.groupby(["Department","Gender"])["Salary"].mean())      #to print the average salary department and gender wise

49000.0
Summarise based on grouping values in a column
Department
Finance    50000.000000
HR         47333.333333
IT         49500.000000
Name: Salary, dtype: float64
Summarizing based on grouping multiple columns
Department  Gender
Finance     F         55000.000000
            M         47500.000000
HR          F         41000.000000
            M         60000.000000
IT          F         52000.000000
            M         48666.666667
Name: Salary, dtype: float64

#### MERGING

In [8]:
df_Customer = pd.DataFrame({
    "ID" : [1,2,3],
    "Name" : ["Ram","Shyam","Mohan"]
})
df_order = pd.DataFrame({
    "ID" : [1,2,4],
    "Amount" : [10000,12000,15000]
})

print("After inner Join :\n",pd.merge(df_Customer,df_order, on ="ID",how = "inner")) 
print("After outer Join :\n",pd.merge(df_Customer,df_order, on ="ID",how = "outer"))
print("After left Join :\n",pd.merge(df_Customer,df_order, on ="ID",how = "left")) 
print("After right Join :\n",pd.merge(df_Customer,df_order, on ="ID",how = "right")) 
print("After cross Join :\n",pd.merge(df_Customer,df_order,how = "cross"))

After inner Join :
    ID   Name  Amount
0   1    Ram   10000
1   2  Shyam   12000
After outer Join :
    ID   Name   Amount
0   1    Ram  10000.0
1   2  Shyam  12000.0
2   3  Mohan      NaN
3   4    NaN  15000.0
After left Join :
    ID   Name   Amount
0   1    Ram  10000.0
1   2  Shyam  12000.0
2   3  Mohan      NaN
After right Join :
    ID   Name  Amount
0   1    Ram   10000
1   2  Shyam   12000
2   4    NaN   15000
After cross Join :
    ID_x   Name  ID_y  Amount
0     1    Ram     1   10000
1     1    Ram     2   12000
2     1    Ram     4   15000
3     2  Shyam     1   10000
4     2  Shyam     2   12000
5     2  Shyam     4   15000
6     3  Mohan     1   10000
7     3  Mohan     2   12000
8     3  Mohan     4   15000

#### CONCATENATE

In [15]:
df_Customer = pd.DataFrame({
    "ID" : [1,2,3],
    "Name" : ["Ram","Shyam","Mohan"]
})
df_order = pd.DataFrame({
    "ID" : [1,2,4],
    "Amount" : [10000,12000,15000]
})

print(pd.concat([df_Customer,df_order], axis = 0,ignore_index=True))     #row wise concatenation
print()
print(pd.concat([df_Customer,df_order],axis =1, ignore_index=True))      #column wise concatenation

   ID   Name   Amount
0   1    Ram      NaN
1   2  Shyam      NaN
2   3  Mohan      NaN
3   1    NaN  10000.0
4   2    NaN  12000.0
5   4    NaN  15000.0

   0      1  2      3
0  1    Ram  1  10000
1  2  Shyam  2  12000
2  3  Mohan  4  15000